Revit 2027 API
IFCExtrusionCalculatorUtils Class
 A utility class used to calculate extrusion data from Revit geometry for IFC export.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorUtils
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class IFCExtrusionCalculatorUtils
Public NotInheritable Class IFCExtrusionCalculatorUtils
public ref class IFCExtrusionCalculatorUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type IFCExtrusionCalculatorUtils = class end
The IFCExtrusionCalculatorUtils type exposes the following members.
Methods
Name | Description
CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) |  Calculates the extrusion data from a Revit geometry object.
CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<Face>)
Top
See Also
Reference
Autodesk.Revit.DB.IFC Namespace